packages.el
;VISUAL
(package! all-the-icons-dired)
(package! all-the-icons)
(package! doom-themes)
;PYTHON____________________
(package! poetry)
(package! conda)
(package! lsp-pyright)
(package! virtualenvwrapper)
(package! dap-mode)
;;(package! lsp-python-ms)
(package! nose)
(package! python-pytest)
(package! py-isort)
(package! python-black)
;ORG_____________________
(package! org-fragtog)
(package! org-auto-tangle)
(package! org-modern)
(package! org-download)
(package! pandoc)
(package! ox-pandoc)
;COMPLETION______________
(package! cape)
;(package! corfu)
;MATH____________________
(package! auctex)
(package! company-math)
(package! texfrag)
;WEB_____________________
(package! ssh-agency)
;(package! lsp-tailwindcss)
(package! doremi)
